[
  {
    "name": "Leveraging Authority and Relationships to Thrive in Business with Jed Morley",
    "slug": "leveraging-authority-and-relationships-to-thrive-in-business-with-jed-morley",
    "image": "/episodes/leveraging-authority-and-relationships-to-thrive-in-business-with-jed-morley.png",
    "date": "2026-02-07",
    "description": "In a world obsessed with \"cheat codes\" and rapid scaling, true authority is built on the unshakeable foundation of personal mindset and execution. This article explores the core principles of the \"Authority Formula,\" highlighting why clarity only follows action, the critical role of relationship capital, and why being 1% better every day is the only real way to win the long game.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "H9AgjKTUP",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 39
  },
  {
    "name": "Why Massage Therapy Is More Than Just A Luxury With Dr. Dominique Carson",
    "slug": "why-massage-therapy-is-more-than-just-a-luxury-with-dr-dominique-carson",
    "image": "/episodes/why-massage-therapy-is-more-than-just-a-luxury-with-dr-dominique-carson.jpg",
    "date": "2026-02-06",
    "description": "Dr. Dominique Carson discusses how massage therapy regulates the nervous system as well as the other body systems, making it essentially an extension of nursing.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "hR54ZOy-U",
    "videoUrl": "https://youtu.be/V1yoqy0yyJI",
    "hasTranscript": true,
    "episodeNumber": 38
  },
  {
    "name": "Maximizing Impact And Purpose: How To Be A Legacy Catalyst With Jeanne Omlor",
    "slug": "maximizing-impact-and-purpose-how-to-be-a-legacy-catalyst-with-jeanne-omlor",
    "image": "/episodes/maximizing-impact-and-purpose-how-to-be-a-legacy-catalyst-with-jeanne-omlor.jpg",
    "date": "2026-01-14",
    "description": "Certified business strategist and online business coach Jeanne Omlor shows how to become a success catalyst, maximizing your impact, purpose, and legacy.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "FkquhvVzT",
    "videoUrl": "https://youtu.be/qpx8vw-QpnY",
    "hasTranscript": true,
    "episodeNumber": 37
  },
  {
    "name": "Teaching People To Beat Chronic Fatigue With Miguel Bautista",
    "slug": "teaching-people-to-beat-chronic-fatigue-with-miguel-bautista",
    "image": "/episodes/teaching-people-to-beat-chronic-fatigue-with-miguel-bautista.jpg",
    "date": "2026-01-07",
    "description": "Miguel Bautista shares how he has developed the CFS Recovery System to help people get rid of chronic fatigue and achieve peak performance.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "pEA4wQkSi",
    "videoUrl": "https://youtu.be/e3vbDlbidV4",
    "hasTranscript": true,
    "episodeNumber": 36
  },
  {
    "name": "Secrets of Tax Lien Investing Revealed with Dale Merkord",
    "slug": "secrets-of-tax-lien-investing-revealed-with-dale-merkord",
    "image": "/episodes/secrets-of-tax-lien-investing-revealed-with-dale-merkord.png",
    "date": "2025-10-27",
    "description": "In this episode of The Authority Formula Podcast, host George Wright III partners with Valiant CEO magazine to discuss wealth planning strategies with seasoned real estate investor Dale Merkord. They delve into the complexities and lucrative potential of tax liens and deeds, a lesser-known investment strategy that offers guaranteed returns. Dale shares his transition from bank foreclosures to tax liens, the intricate process of property evaluation, and how his company, Certainty Investment Group, simplifies this for investors. They highlight the due diligence required, the common mistakes to avoid, and the benefits of partnering with experts to achieve consistent, secured returns. Perfect for those seeking to enhance their investment portfolios or venture into real estate with minimal hands-on involvement.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "QmXyWJhe2",
    "videoUrl": "https://youtu.be/Vny_ZMGiPTM",
    "hasTranscript": true,
    "episodeNumber": 35
  },
  {
    "name": "Charlie Chen & Ultra Wellness Gear on Reclaiming Agency Through Mindset",
    "slug": "charlie-chen-ultra-wellness-gear-on-reclaiming-agency-through-mindset",
    "image": "/episodes/charlie-chen-ultra-wellness-gear-on-reclaiming-agency-through-mindset.png",
    "date": "2025-10-09",
    "description": "In this insightful episode of The Authority Formula Podcast, host George Wright III interviews Charlie Chen, founder of Ultra Wellness Gear. Charlie shares his unique journey from growing up in a Buddhist monastery to becoming a successful entrepreneur. The discussion dives into the importance of mindset, overcoming past stories, and developing leaders within organizations. Charlie outlines his three-step transformation process: uncovering your story, getting complete with your past, and inventing new possibilities. He also touches on the significance of daily rituals like 'The Miracle Morning' and offers final tips for achieving inner peace and addressing external challenges through leadership strategies.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "oMIPd4L_n",
    "videoUrl": "https://youtu.be/1TEbTgm-Rp0",
    "hasTranscript": true,
    "episodeNumber": 34
  },
  {
    "name": "Deep Dive Into Physical Therapy With Dr. Ray Waters",
    "slug": "deep-dive-into-physical-therapy-with-dr-ray-waters",
    "image": "/episodes/deep-dive-into-physical-therapy-with-dr-ray-waters.jpg",
    "date": "2025-09-15",
    "description": "Dr. Ray Waters talks about his one-on-one approach in physical therapy that help address the specific needs of his patients, particularly overhead athletes.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "b2geQ34i8",
    "videoUrl": "https://youtu.be/_3L5Vpz30Dc",
    "hasTranscript": true,
    "episodeNumber": 33
  },
  {
    "name": "Unleashing your potential",
    "slug": "unleashing-your-potential",
    "image": "/episodes/unleashing-your-potential.png",
    "date": "2025-05-06",
    "description": "George Wright III speaks with Florian Rolke, a high-performance coach with a remarkable story—from selling strawberries door-to-door to coaching elite entrepreneurs, AI leaders, and investors worldwide. With a background in business psychology and over 170 books studied, Florian shares how inner work, self-awareness, and personalized strategies are key to lasting success. This episode dives into breaking negative patterns, building clarity, and using mindset as a form of action—offering practical tools for growth in both business and life.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "E_RlCprLz",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 32
  },
  {
    "name": "More Than Teeth: Exploring Sleep Dentistry",
    "slug": "more-than-teeth-exploring-sleep-dentistry",
    "image": "/episodes/more-than-teeth-exploring-sleep-dentistry.png",
    "date": "2025-04-29",
    "description": "George Wright III speaks with Dr. Mike Bennett, a dentist turned sleep health expert, about the powerful connection between oral health and total body wellness. Dr. Bennett shares how his journey into sleep dentistry helped him uncover life-changing solutions for patients struggling with undiagnosed sleep disorders. With real-life stories and practical insights, this conversation sheds light on the warning signs of sleep apnea, the importance of early diagnosis, and the transformative power of airway-focused care. It’s a must-listen for anyone serious about improving their health—from the inside out.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "pLVk0gi8c",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 31
  },
  {
    "name": "Dare to Dream: Building Your Future",
    "slug": "dare-to-dream-building-your-future",
    "image": "/episodes/dare-to-dream-building-your-future.png",
    "date": "2025-04-22",
    "description": "George Wright III welcomes Regina Martin—an educator, speaker, and author with a powerful message for students, professionals, and aspiring dreamers. Regina shares her journey from government service to education and breaks down the core message of her book You Belong Here: Transitioning to Success. The conversation focuses on helping people gain clarity, build confidence, and take action using her signature DREAM Method. Whether you're guiding students or chasing a personal goal, Regina’s wisdom on patience, networking, and purpose is deeply impactful.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "3hon277Nq",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 30
  },
  {
    "name": "Reinventing The Pitch To Fund Your Business",
    "slug": "reinventing-the-pitch-to-fund-your-business",
    "image": "/episodes/reinventing-the-pitch-to-fund-your-business.png",
    "date": "2025-04-15",
    "description": "George Wright III sits down with entrepreneur and investor Kent Richeson, founder of Shit Pitch—a bold live pitch event that strips away polish to reveal the real traits investors look for in founders. Kent shares his own entrepreneurial journey and explains how humor, high pressure, and honesty help uncover the raw potential of business leaders. From pitch structure to mindset, this conversation offers practical advice on validating ideas, attracting investment, and showing up authentically in the business world.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "VTyVWqjQx",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 29
  },
  {
    "name": "The Power of Positive Affirmations",
    "slug": "the-power-of-positive-affirmations",
    "image": "/episodes/the-power-of-positive-affirmations.png",
    "date": "2025-04-08",
    "description": "George Wright III interviews Dennis M. Mbogori, a powerful voice in personal development and author of Affirm Your Greatness. Dennis shares his inspiring story—from growing up in Kenya to navigating culture shock and self-doubt in the U.S.—and how discovering John Maxwell’s leadership principles helped him transform his life. Now a certified coach and speaker, Dennis dives into the science of neuroplasticity, the impact of affirmations, and the practical steps he used to build a life of purpose. This episode is a must-listen for anyone ready to shift their mindset and take action.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "CqJB4nZOp",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 28
  },
  {
    "name": "Shifting Your Mindset to Create Your Best Life",
    "slug": "shifting-your-mindset-to-create-your-best-life",
    "image": "/episodes/shifting-your-mindset-to-create-your-best-life.png",
    "date": "2025-04-01",
    "description": "George Wright III sits down with Gabriel Sedlak—an entrepreneur, speaker, and coach with a powerful story of transformation. Gabriel opens up about his early struggles, self-sabotage, and how discovering network marketing became a catalyst for personal growth and success. From overcoming doubt to developing confidence, the conversation touches on faith, family, mindset, and the environments that shape us. If you’re ready to break through limits and create lasting change, this episode delivers the inspiration and tools to get started.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "B2ZykI_vb",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 27
  },
  {
    "name": "Mastering Real estate With Candice Amundson",
    "slug": "mastering-real-estate",
    "image": "/episodes/mastering-real-estate.avif",
    "date": "2025-03-25",
    "description": "George Wright III welcomes Candice Amundson—a seasoned realtor, investor, and single mom—who specializes in vacation and short-term rental properties. Candice shares how she built a thriving business through strategic investments, data-driven decisions, and a commitment to local expertise. The conversation dives into emerging market trends, the power of digital marketing, and how she balances entrepreneurship with motherhood. With a resilient mindset and real-world experience, Candice offers practical advice for anyone looking to grow in real estate or life.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "PgGl9s32_",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 26
  },
  {
    "name": "Building Authority",
    "slug": "building-authority",
    "image": "/episodes/building-authority.png",
    "date": "2025-03-18",
    "description": "George Wright III sits down with Greg Anderson, a seasoned system architect and entrepreneur, to unpack how viewing life and business as systems can unlock next-level success. Greg shares his inspiring journey of overcoming dyslexia, building authority through content, and using tech strategically to control and monetize platforms. The conversation spans business innovation, community building, personal growth, and the mindset needed to thrive. If you're looking to realign your business with passion and purpose, this episode is packed with the insights you need.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "HxS8CSXyr",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 25
  },
  {
    "name": "Revolutionizing Relationship Insights",
    "slug": "revolutionizing-relationship-insights",
    "image": "/episodes/revolutionizing-relationship-insights.png",
    "date": "2025-03-11",
    "description": "George Wright III welcomes James Pizzola, a tech entrepreneur with a deep interest in psychology, to discuss his latest project—a mobile app designed to strengthen relationships using data-driven insights. With over ten years in IT and a background in leadership, James explains how his app helps users log meaningful interactions, reflect on patterns, and make smarter relational decisions. He also opens up about personal growth, self-awareness, and how the same principles that build great relationships apply to effective business leadership.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "8FAELUTXG",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 24
  },
  {
    "name": "Building Business Success through Payment Solutions",
    "slug": "building-business-success-through-payment-solutions",
    "image": "/episodes/building-business-success-through-payment-solutions.png",
    "date": "2025-03-04",
    "description": "George Wright III sits down with Colton Page, Chief Sales Officer and co-owner of PlatPay, to explore the complex world of payment processing. Colton shares his journey from knocking on doors to co-leading a merchant processing firm that’s handled over a billion dollars in transactions. The conversation covers sales mastery, fraud prevention, banking redundancy, and the evolving landscape of financial tech. Plus, Colton introduces Payment Cowboys, a unique initiative bringing clarity and custom solutions to the Western and cowboy business communities.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "2Y1QpQp48",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 23
  },
  {
    "name": "Authority Through Streaming",
    "slug": "authority-through-streaming",
    "image": "/episodes/authority-through-streaming.png",
    "date": "2025-02-25",
    "description": "George Wright III sits down with Sean Stockell, CEO of Your Home Digital and founder of Your Home TV, to explore his journey from the world of banking to the forefront of digital media and streaming. Sean shares how his passion for education, trust, and innovation led to the creation of a platform that’s reshaping how consumers connect with home-focused content. They discuss the power of content ownership, the importance of trust in building loyal audiences, and what businesses need to know before stepping into the streaming space. Sean also breaks down how Your Home TV is creating new opportunities for collaboration and growth in the digital media world.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "93YGkkNuu",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 22
  },
  {
    "name": "Mastering Business with Technology",
    "slug": "mastering-business-with-technology",
    "image": "/episodes/mastering-business-with-technology.png",
    "date": "2025-02-18",
    "description": "George Wright III talks with Jamie Gilleland, a business innovation expert and CEO of RIF Social. With a background in digital marketing and automation—including her work with Infusionsoft (now Keap)—Jamie shares how she helps businesses streamline operations and drive results through automation and targeted Facebook ads. They discuss how automated systems can build visibility, authority, and customer engagement—without constant manual effort. Jamie also opens up about overcoming a brain tumor and how that life challenge reshaped her approach to business, leading to a more intentional, life-focused strategy.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "xuWVDxYEf",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 21
  },
  {
    "name": "Beyond the Mic: Building Influence through Podcasting",
    "slug": "beyond-the-mic-building-influence-through-podcasting",
    "image": "/episodes/beyond-the-mic-building-influence-through-podcasting.png",
    "date": "2025-02-11",
    "description": "George Wright III interviews Tom Hazzard, podcasting expert and co-owner of Podetize. With decades of experience supporting speakers, authors, and thought leaders, Tom shares how podcasting can be a powerful tool for building authority and expanding reach. They explore the importance of turning podcast episodes into long-form blog content to boost SEO and longevity, as well as innovative strategies like Promo Cast for getting more eyes (and ears) on your show. Tom breaks down how multicasting, syndication, and the power of voice can amplify your message and influence in a crowded marketplace.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "Y5bKwt2pf",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 20
  },
  {
    "name": "Journey Beyond: A Deep Dive into Luxury Travel Strategies",
    "slug": "journey-beyond-a-deep-dive-into-luxury-travel-strategies",
    "image": "/episodes/journey-beyond-a-deep-dive-into-luxury-travel-strategies.png",
    "date": "2025-02-04",
    "description": "George Wright III sits down with Spencer Howard, founder of Straight to the Points and a recognized expert in credit card loyalty and travel rewards. Spencer shares how he transitioned from a career in politics to helping others unlock luxury travel experiences through smart use of points. They explore actionable strategies to maximize transferable credit card points, bust common myths about credit usage, and uncover how mindset and money flow play a role in creating abundant, experience-rich lives. Whether you’re a frequent traveler or just getting started, Spencer’s insights offer a path to travel better—without spending more.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "e3Vz0O8c-",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 19
  },
  {
    "name": "Mastering Abundance",
    "slug": "mastering-abundance",
    "image": "/episodes/mastering-abundance.png",
    "date": "2025-01-28",
    "description": "George Wright III interviews Nicole Kernohan, a high-performance coach and COO of a leading coaching organization. Nicole shares her powerful journey from corporate strategist to entrepreneur, including how she overcame a diagnosis of MS and found new purpose in helping others grow. They discuss the deep impact of mindset, subconscious programming, and consistent daily habits on personal and professional success. Nicole offers actionable advice on developing morning routines, shifting your relationship with abundance, and reprogramming limiting beliefs through repetition and intention. She also introduces her free 30-day abundance journal as a tool to support lasting transformation.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "TTQpbBBRY",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 18
  },
  {
    "name": "How to Make Money with Your Invention Idea",
    "slug": "how-to-make-money-with-your-invention-idea",
    "image": "/episodes/how-to-make-money-with-your-invention-idea.png",
    "date": "2025-01-21",
    "description": "George Wright III talks with Brian Fried, a prolific inventor and founder of Inventor Smart. With 15 patents and several licensed products under his belt, Brian shares how simple observations of everyday problems sparked his journey into inventing—and how anyone with an idea can do the same. They explore the full invention process: from brainstorming and prototyping to patenting and launching a product. Brian breaks down key strategies for protecting intellectual property, making smart business decisions, and avoiding the emotional pitfalls that often block progress. His practical advice empowers both new and seasoned inventors to move forward with confidence.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "tmMAj1and",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 17
  },
  {
    "name": "Mastering Sales Psychology",
    "slug": "mastering-sales-psychology",
    "image": "/episodes/mastering-sales-psychology.png",
    "date": "2025-01-14",
    "description": "George Wright III explores the world of sales psychology with Simon Severino, CEO of Strategy Sprints. Simon shares how his curiosity about buyer behavior led him into sales—and why asking better questions and listening more can dramatically improve your close rate. They dive into practical ways to boost sales performance, from shortening the sales cycle to raising prices with confidence. Simon also shares insights from his book Strategy Sprints, offering clear, actionable steps entrepreneurs can use to grow their businesses faster and more sustainably.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "VapSxdpuR",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 16
  },
  {
    "name": "Scaling Your Business with a Next Level Identity",
    "slug": "scaling-your-business-with-a-next-level-identity",
    "image": "/episodes/scaling-your-business-with-a-next-level-identity.png",
    "date": "2025-01-07",
    "description": "George Wright III welcomes Jason Moss, a business coach and mentor to a thriving community of over 20,000 coaches. Jason shares his story of launching his first business at 13 and scaling multiple seven-figure ventures—all by blending technology, communication, and deep inner work. They explore the connection between mindset and strategy, highlighting the role of identity in business success. Jason unpacks his four-pillar framework—niche, offer, audience, and enrollment—and emphasizes how curiosity, intuition, and inner development can unlock both personal and professional breakthroughs.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "LDuuLfhTI",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 15
  },
  {
    "name": "De-Escalate: How to Calm an Angry Person in 90 Seconds or Less",
    "slug": "de-escalate-how-to-calm-an-angry-person-in-90-seconds-or-less",
    "image": "/episodes/de-escalate-how-to-calm-an-angry-person-in-90-seconds-or-less.png",
    "date": "2024-12-31",
    "description": "George Wright III interviews Doug Noll, a former trial lawyer who left the courtroom behind to pursue peacemaking and emotional intelligence. Doug shares how his background in law and philosophy led him to question the traditional approaches to conflict—and ultimately devote his life to helping people manage emotions and resolve disputes through empathy and neuroscience. They discuss how skills like affect labeling and emotional awareness can transform leadership, foster trust, and create emotionally safe environments at home and at work. Doug also offers tangible practices for mastering emotional competence and shares tools to apply immediately.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "aafVPmp2f",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 14
  },
  {
    "name": "Community and Cocktails",
    "slug": "community-and-cocktails",
    "image": "/episodes/community-and-cocktails.png",
    "date": "2024-12-24",
    "description": "George Wright III speaks with Jack Espy, founder and CEO of Spirited Hive, about how he turned a pandemic-born idea into a rapidly growing canned cocktail brand. Jack walks through the highs and lows of launching a business in uncertain times, offering honest insights on risk-taking, resilience, and the role of community in building a brand. From finding his ‘why’ to going all in, Jack shares actionable advice for entrepreneurs—including the importance of storytelling, adaptability, and staying rooted in passion. It’s a powerful look at what it really takes to launch and lead with purpose.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "8YI9UX8yr",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 13
  },
  {
    "name": "Emotions Drive Your Behavior",
    "slug": "emotions-drive-your-behavior",
    "image": "/episodes/emotions-drive-your-behavior.png",
    "date": "2024-12-17",
    "description": "George Wright III sits down with Rob Kalwarowsky, a TEDx speaker and co-host of the Leadership Launchpad Project. Rob shares his journey from MIT-trained engineer to leadership coach, opening up about the personal challenges he faced working in toxic environments and how personal development helped him rewrite his future. They unpack the power of mindset, the subconscious, and the transformational impact of coaching and mentorship. Rob also walks through the behind-the-scenes of delivering a TED Talk and offers tangible tools for navigating difficult leadership dynamics—including a free eBook and discounted course for those dealing with toxic bosses.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "msQFIGHbM",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 12
  },
  {
    "name": "Inside the 7-Figure Machine",
    "slug": "inside-the-7-figure-machine",
    "image": "/episodes/inside-the-7-figure-machine.png",
    "date": "2024-12-10",
    "description": "George Wright III welcomes Dr. Noah St. John, a best-selling author and expert on mindset and affirmations. Dr. St. John shares how he went from poverty to becoming a trusted advisor for celebrities and high performers around the world. They dive deep into the mindset shifts required for massive financial growth, discuss his signature “Seven-Figure Machine” framework, and highlight why money loves speed—especially for entrepreneurs ready to take bold, focused action.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "KP7Vddodm",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 11
  },
  {
    "name": "Overcoming Obstacles On and Off the Field with NFL Player",
    "slug": "overcoming-obstacles-on-and-off-the-field-with-nfl-player",
    "image": "/episodes/overcoming-obstacles-on-and-off-the-field-with-nfl-player.png",
    "date": "2024-12-03",
    "description": "George Wright III sits down with Bronson Kaufusi, former NFL player turned mindset coach and investor. Bronson opens up about his journey from high school All-American to playing for top NFL teams—and how mindset was the key to pushing through injuries and life transitions. Now focused on helping the next generation, Bronson shares details about his upcoming project, Young Athlete Society, and the importance of mental conditioning, presence, and personal growth beyond sports.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "j4ysELzW8",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 10
  },
  {
    "name": "The Million Dollar Collar Story",
    "slug": "the-million-dollar-collar-story",
    "image": "/episodes/the-million-dollar-collar-story.png",
    "date": "2024-11-26",
    "description": "George Wright III talks with Rob Kessler, the creative mind behind Million Dollar Collar and Go Tieless. From early ventures to creating a product that redefined the dress shirt industry, Rob shares his journey of grit, innovation, and unwavering belief in solving real-world problems. Learn how he navigated setbacks, broke into a competitive market, and built a brand with global impact—all while staying true to his vision.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "kImS1QKH9",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 9
  },
  {
    "name": "Building the NFL of eSports: An Interview with Titus Walker",
    "slug": "building-the-nfl-of-esports-an-interview-with-titus-walker",
    "image": "/episodes/building-the-nfl-of-esports-an-interview-with-titus-walker.png",
    "date": "2024-11-19",
    "description": "George Wright III is joined by Titus Walker, founder of UEL, who’s building what he believes will be the “NFL of Esports.” Titus shares how his passion, curiosity, and relentless drive led him from early hustles to real estate and ultimately to pioneering a new future in gaming. He dives into what it means to be addicted to progress, how to spot opportunities others miss, and why building a legacy business rooted in family and purpose has been his mission from day one. This one’s packed with visionary thinking, success principles, and next-level insight into the explosive world of esports.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "OWQ1wa4Yc",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 8
  },
  {
    "name": "Creating an Epic Life Through Innovation",
    "slug": "creating-an-epic-life-through-innovation",
    "image": "/episodes/creating-an-epic-life-through-innovation.png",
    "date": "2024-11-12",
    "description": "George Wright III talks with Terry Rich, entrepreneur, author, and the man behind uncovering the largest lottery fraud in U.S. history. From growing up on an Iowa farm to becoming a media executive and successful business leader, Terry shares stories of entrepreneurship, innovation, and integrity. He breaks down how to bounce back from failure, foster creative thinking, and stay ethical while scaling. Bonus: he even drops a wild “million-dollar idea” involving advertising on the moon.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "rAy1ryNTf",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 7
  },
  {
    "name": "The PPM Method for Mastering Disruption",
    "slug": "the-ppm-method-for-mastering-disruption",
    "image": "/episodes/the-ppm-method-for-mastering-disruption.png",
    "date": "2024-11-05",
    "description": "George Wright III sits down with Chris Marshall, behavioral scientist, futurist, and author of Decoding Change. Chris shares how leaders can navigate radical change by mastering their mental state and infusing playfulness into decision-making. Learn about his P M Method (Pause, Play, Move)—a powerful framework to reduce stress, spark creativity, and lead through uncertainty. This episode is a must-listen for anyone facing fast-paced change and looking to cultivate resilience, innovation, and positive leadership.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "_mxfLn0ry",
    "videoUrl": null,
    "hasTranscript": false,
    "episodeNumber": 6
  },
  {
    "name": "Creating Credibility through Clarity",
    "slug": "creating-credibility-through-clarity",
    "image": "/episodes/creating-credibility-through-clarity.png",
    "date": "2024-10-29",
    "description": "George Wright III interviews Mitchell Levy, global credibility expert and author of 60+ books. Mitchell unpacks the real meaning of credibility—beyond social proof—and why it’s the foundation of lasting success in both business and life. Discover how his CPOP (Customer Point of Possibilities) framework helps clarify your message, elevate trust, and transform your legacy. If you want to build deeper, more authentic connections with your audience, this conversation is a must-listen.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "iE9xHFsql",
    "videoUrl": null,
    "hasTranscript": false,
    "episodeNumber": 5
  },
  {
    "name": "How to Maximize Tax Deductions in Your Business",
    "slug": "how-to-maximize-tax-deductions-in-your-business",
    "image": "/episodes/how-to-maximize-tax-deductions-in-your-business.png",
    "date": "2024-10-22",
    "description": "George Wright III talks with Mike Jesowshek, CPA and tax strategist, about the critical difference between tax planning and tax preparation—and why it matters for business owners. Mike shares proven strategies for maximizing deductions, reducing liabilities, and developing a proactive tax planning mindset. From year-round strategies to audit-proof documentation tips, this conversation is packed with actionable insights that can help you build and protect your wealth.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "N0j7CLdk0",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 4
  },
  {
    "name": "From SEAL to CEO: Leadership Lessons",
    "slug": "from-seal-to-ceo-leadership-lessons",
    "image": "/episodes/from-seal-to-ceo-leadership-lessons.png",
    "date": "2024-10-15",
    "description": "George Wright III sits down with Marty Strong, a retired Navy SEAL turned CEO and author of Be Different. Marty shares leadership lessons from the battlefield to the boardroom—emphasizing the power of adaptability, cross-training, and creativity in high-stakes environments. They explore how chaos can drive innovation, why scenario-based learning builds stronger teams, and how business leaders can create cultures that encourage bold, strategic thinking.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "6UM_0ExFo",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 3
  },
  {
    "name": "Profit with Presence",
    "slug": "profit-with-presence",
    "image": "/episodes/profit-with-presence.png",
    "date": "2024-10-08",
    "description": "George Wright III welcomes Dr. Eric Holsapple, a CEO with a PhD in economics and over 40 years in real estate, who now teaches leaders how to blend mindfulness with business success. Dr. Holsapple shares how meditation, yoga, and presence transformed his approach to leadership—and how you can do the same. He unpacks the 12 Pillars of Mindful Leadership from his book Profit with Presence, offering simple, powerful steps to improve your focus, fulfillment, and performance.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "kMpw3qpH8",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 2
  },
  {
    "name": "Understanding Business Infrastructure",
    "slug": "understanding-business-infrastructure",
    "image": "/episodes/understanding-business-infrastructure.png",
    "date": "2024-10-01",
    "description": "George Wright III interviews Alicia Butler Pierre, a business infrastructure expert who went from chemical engineer to CEO. Alicia breaks down how organizing your systems, processes, and people can unlock sustainable growth. Learn how to spot when your business needs infrastructure, and discover tools like Zoom, Loom, and Notion to streamline operations. Whether you’re scaling or just starting out, this episode is packed with actionable insights to help you build authority and efficiency in your business.",
    "audioUrl": "/audio/placeholder.wav",
    "audioId": "XLIIVwcex",
    "videoUrl": null,
    "hasTranscript": true,
    "episodeNumber": 1
  }
]